package com.ict.day09;

public class Ex01 {

	public static void main(String[] args) {
		/* 클래스 
		 * 1. 정의 : 객체(Object, 오브젝트)를 만들어서 사용할  모든 정보와 기능에 대해 기술해 놓은 파일
		 * 			보통은 설계도,거푸집, 틀,이라고 한다.
		 * 			예) 붕어빵 틀 (클래스) => 먹을 수 있는 붕어빵(객체, Object)
		 * 			데이터를 저장하는 측면에서 보면 모든 기본 자료형과 참조자료형을 저장 할 수 있다.
		 * 			변수 < 배열 < 클래스 < 컬랙션(자료구조)
		 * 			변수 < 배열 < 클래스 < 객체형 배열(참조자료형 배열)
		 * 2. 클래스가 가질 수 있는 3가지 요소
		 *  - 멤버필드 : 변수와 상수 , 속성, 특징
		 *  - 멤버 메서드 : 동작,기능, 하는 것
		 *  - 생성자  :클래스를 객체로 생성할 때 한번 호출된다.
		 *  			맴버필드의 초기값 지정하는 것이 목적이다.
		 *  			물론 메서드처럼 기능들을 추가할 수 도 있다.
		 *  			클래스 이름 = 저장 이름 = 생성자
		 *  			클래스 이름과 같으면서 () 가 있으면 생성자 이다.
		 *    예) Scanner scan = new Scanner(System.in)
		 *    	클래스   참조변수 = 객체생성 생성자  
		 * */

	}

}
