package com.ict.day16;

public class Ex01 {
/*
 제네릭과 컬렉션을 (자료구조)
 제네릭 : 컬렉션이 어떤 객체들로 이루어졌는지 표시하기위한 객체 타입
 컬렉션 : 객체들을 모아서 저장,관리하는 인터페이스들을 말한다.
 
 변수 - > 하나의 데이터만 저장할 수 있다.
 배열 -> 같은 종류에 자료형을 여러개 묶어서 저장할 수있다.
 		단점: 크기를 미리 지정해야함
 클래스 -> 다양한 종류의 자료형을 저장할 수있다.
 
 ** 객체(클래스)를 모아서 처리하는 방법: 컬랙션, 객체형 배열
    
    형식) 컬랙션<제네릭>
    API : <T> => 객체 타입, <E> =>요소(Element), 컬랙션 안에서 존재하는 객체 하나 하나를 뜻한다.
    	  <K,V> => Key(키), Value(데이터), Key를 호출하면 value가 나온다.
    	  
   	최상위 클래스 : Collection<E>, Map<K,V>
   	Collection을 상속받은 인터페이스 : Set<E>, List<E>, Queue<E>
   	
    
 */
}
